# This is a sample Python script.

# Press Shift+F10 to execute it or replace it with your code.
# Press Double Shift to search everywhere for classes, files, tool windows, actions, and settings.
nepaliHoroscopes = [
    "आम्दानी बढ्नाले उत्साह जाग्नेछ। श्रमको उचित मूल्य पाइनेछ। व्यापारमा राम्रै फड्को मार्न सकिनेछ। छोटो समयमै राम्रो उपलब्धि हातलागी हुनेछ। पहिले रोकिएको काम बन्नेछ भने जिम्मेवारी समेत बढ्न सक्छ। दिगो फाइदा हुने काम प्रारम्भ होला। साझेदारीबाट पनि लाभ मिल्नेछ। भौतिक साधन जुट्नेछन्। सञ्चित धनको उपयोगबाट विशेष फाइदा हुनेछ।",
    "बिस्तारै अरूलाई प्रभावित पारेर काम बनाउने समय छ। आफ्नो क्षेत्रमा प्रभुत्व जमाउन सकिनेछ। कीर्तिमानी काम सम्पादन गर्ने समय छ। दाम, इनाम र प्रतिष्ठा कमाउने बेला छ। प्रतिष्ठित काम गरेर धेरैको मन जित्न सकिनेछ। विशिष्ट व्यक्तिहरूसँग मित्रता बढ्नेछ। भूमि, वाहन र पैत्रिक सम्पत्तिबाट लाभ मिल्नेछ। व्यापारमा पनि प्रशस्त फाइदा हुनेछ।",
    "चुनौतीपूर्ण कामको दायित्व लिनाले धेरै परिश्रम गर्दा न्यून सफलता मिल्नेछ। सहयोगी जुटाउन नसकिएला। आँटेका काम पूरा नभए पनि आंशिक फाइदा हुनेछ। धर्ममा श्रद्धा र परोपकारमा मन जानेछ। स्वास्थ्यमा भने कमजोरी अनुभव हुनेछ। तापनि प्रयत्न गर्दा समयको सदुपयोग हुनेछ। शुभचिन्तकहरू जुट्नाले आस मारेको फल पुनः प्राप्त हुन सक्छ।",
    "सानातिना काममा अल्झनुपर्दा मुख्य काम राेकिन सक्छ। केही समस्या दोहोरिनाले उत्साहमा कमी आउनेछ। तर फाइदाका स्रोत पहिचान गर्न सकिनेछ। प्रयत्न गर्दा नियमित काम सम्पादन हुनेछन्। तत्काल लाभ नभए पनि नयाँ काम प्रारम्भ हुनेछ। दिगो योजनाका साथ अघि बढ्दा बिस्तारै लाभ उठाउन सकिनेछ। समस्या दर्साउँदा शुभचिन्तकले साथ दिनेछन्।",
    "आफन्त र साथीभाइबाट सहयोग तथा हौसला प्राप्त हुनेछ। आम्दानी बढाउने काम सुरु गर्न सकिनेछ। सुन्दर पहिरनले व्यक्तित्वमा निखारता ल्याउनेछ। अतिथिको रूपमा सत्कार पाइएला। एकपछि अर्को अवसर आउनाले मन प्रसन्न रहनेछ। व्यवसायको सन्दर्भमा रमाइलो यात्रा हुन सक्छ। मनपर्ने भौतिक साधन जोड्ने समय छ। मनग्य धनलाभ हुनेछ।",
    "हिम्मतले काम बनाउन सकिनेछ। यस अघिको उपलब्धिले काममा उत्साह जगाउनेछ। मेहनत गर्दा विभिन्न अवसर प्राप्त हुनुका साथै दैनिकीमा परिवर्तन आउनेछ। अप्ठ्यारा काम पनि सम्पादन हुन सक्छन्। ईर्ष्या गर्नेहरूको मनोबल कमजोर हुनेछ भने प्रतिस्पर्धीहरूलाई पछि पार्ने समय छ। पहिले दुश्मनी गर्नेहरूले समेत मित्रताका हात अघि बढाउलान्।",
    "परिस्थितिवश अध्ययनमा पछि परिनेछ भने व्यवसायमा समेत सोचेको फाइदा नउठ्ने देखिन्छ। स्वास्थ्यमा देखिएको कमजोरीले आँटेका काममा बाधा उत्पन्न होला। पछिका लागि फाइदा हुने भए पनि सोचेको परिणाम तत्काल प्राप्त नहुन सक्छ। नयाँ योजना प्रारम्भ गर्न मुस्किल पर्ला। अप्रिय समाचारले मन खिन्न तुल्याउन सक्छ। आफूलाई कमजोर भएको अनुभूति हुनेछ।",
    "बेसुरमा गरिएका सम्झौता तोड्नुपर्ने आवश्यकता पर्न सक्छ। श्रम गरीकन उचित मूल्य प्राप्त नहुन सक्छ। आश्वासन बाँड्नेहरूको भरपर्दा दु:ख पाइनेछ। परिस्थितिले अप्ठ्यारो मोडमा पुर्याउन सक्छ। आफ्ना कमजोरीको फाइदा अरूले उठाउन सक्छन्। परिवारजनसँग असमझदारी बढ्नुका साथै काममा बाधा पुग्न सक्छ। घर–गृहस्थीमा समस्या आउने देखिन्छ।",
    "बेसुरमा गरिएका सम्झौता तोड्नुपर्ने आवश्यकता पर्न सक्छ। श्रम गरीकन उचित मूल्य प्राप्त नहुन सक्छ। आश्वासन बाँड्नेहरूको भरपर्दा दु:ख पाइनेछ। परिस्थितिले अप्ठ्यारो मोडमा पुर्याउन सक्छ। आफ्ना कमजोरीको फाइदा अरूले उठाउन सक्छन्। परिवारजनसँग असमझदारी बढ्नुका साथै काममा बाधा पुग्न सक्छ। घर–गृहस्थीमा समस्या आउने देखिन्छ।",
    "समयमा आँट गर्न नसक्दा फाइदा कममात्र हुनेछ। काम रोकिनुका साथै मानसम्मानमा आघात पुग्न सक्छ। आफ्ना कामजोरीमाथि टिप्पणी हुन सक्छ। बोलीको गलत अर्थ लाग्नाले सहयोगीहरू टाढिएलान् । लेनदेनमा पनि विवाद बढ्ने सम्भावना छ। विगतको श्रमबाट भने लाभ हुनेछ। काम र पठन–पाठनमा लगनशील बन्न नसक्ता अरूले आलोचना गर्न सक्छन्।",
    "कामको अवसर प्राप्त भए पनि विशेष भेटघाट र शिष्टाचारमा अलमलिनुपर्ला। खानपानको सोखले स्वास्थ्य प्रतिकूल बन्न सक्छ। राम्रो नतिजा हातपार्न रोकिएको काम दोहोर्याउनुपर्ला। अरूको भरले मात्र सफलता प्राप्त नहुन सक्छ। सहयोगीहरू प्रशस्तै भेटिनेछन्। तर धेरै फल प्राप्त गर्ने आकांक्षाले समस्या निम्त्याउन सक्छ। मिहिनेत गर्दा अध्ययनमा प्रगति हुनेछ।",
    "समयमा होश नपुग्नाले फजुल खर्च बढ्नेछ। परिवारजनबाट टाढिनुपर्ला। प्रलोभन देखाउनेहरूले फसाउन सक्छन्। खर्च गरेर पनि त्यति लाभ उठाउन नसकिएला। फाइदाका पछि लाग्दा आफ्नै धनमाल गुम्न सक्छ। साथीभाइसँग पनि असमझदारी बढ्ला। सहयोग गर्नेहरू कमै भेटिनेछन्। अवसरको खोजीमा दौडधुप गर्नुपर्ला। धेरै लगानी गर्दा थोरै फाइदा हुनेछ।",
]

for x in range(1, 13):
    print(x-1)
    print (nepaliHoroscopes[x-1])